---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.OrientByView
source: html/b65423fa-e8d1-1e3e-5cf0-7b33085f64c8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.OrientByView Property

"Rotate With Text"

## Syntax (C#)
```csharp
public static ForgeTypeId OrientByView { get; }
```